@echo off
chcp 65001 > nul
echo ======================================================
echo 1. Запуск без параметров (дефолтная VFS в памяти)
echo ======================================================
python shell_emulator.py

echo ======================================================
echo 2. Запуск с --vfs и успешным скриптом (--script script_ok.txt)
echo ======================================================
python shell_emulator.py --vfs vfs.json --script script_ok.txt

echo ======================================================
echo 3. Запуск со скриптом с ошибкой (остановка на ошибке)
echo ======================================================
python shell_emulator.py --vfs vfs.json --script script_error.txt
pause
